template/request/get_other_report.xml

<ns2:Envelope xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns3="http://tempuri.org/"
    xmlns:ns4="http://creditinfo.com/CB5/v5.31/SmartSearch" xmlns:ns5="http://creditinfo.com/CB5"
    xmlns:ns6="http://creditinfo.com/CB5/v5.31/CustomReport/ReportInfo">
    <ns2:Header>
        <wsse:Security
            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-9D46ED376D2948C2ED1762849169120109442">
                <wsse:Username>{username}</wsse:Username>
                <wsse:Password
                    Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    {password}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </ns2:Header>
    <ns2:Body>
        <ns3:OTGetReport>
            <ns3:param>
                <ns3:PefindoId>{pefindoId}</ns3:PefindoId>
                <ns3:InquiryReason>{inquiryReason}</ns3:InquiryReason>
                <ns3:SubjectType>{subjectType}</ns3:SubjectType>
            </ns3:param>
        </ns3:OTGetReport>
    </ns2:Body>
</ns2:Envelope>